{
    "04e2a972:en-US": "Projects",
    "04e2a972:fr-CA": "Projets",
    "0c28c5a0:en-US": "Enhanced the platform’s developer console, advancing cutting-edge 3D web technologies. Led the development of a robust graph editor to extend 3D engine capabilities. Directed the development of an government-funded innovation project. Over-seeing the successful execution of its key features.",
    "0c28c5a0:fr-CA": "Amélioration de la console développeur de la plateforme, mettant de l'avant des technologies 3D web de pointe. Direction du développement d’un éditeur de graphes robuste pour étendre les capacités du moteur 3D. Pilotage d’un projet d’innovation financé par le gouvernement, assurant la réussite des fonctionnalités clés.",
    "0de8d5b9:en-US": "Full-stack developer",
    "0de8d5b9:fr-CA": "Développeur full-stack",
    "170077c1:en-US": "Valve Corporation",
    "170077c1:fr-CA": "Valve Corporation",
    "1a5a657a:en-US": "Technical Skills",
    "1a5a657a:fr-CA": "Connaissances Techniques",
    "20e01515:en-US": "Management Computing - Collège Montmorency",
    "20e01515:fr-CA": "Informatique de Gestion - Collège Montmorency",
    "24ffed7b:en-US": "Contact me",
    "24ffed7b:fr-CA": "Où me joindre",
    "2507db94:en-US": "Key technologies",
    "2507db94:fr-CA": "Technologies clés",
    "265b264a:en-US": "Infrastructure and Tools",
    "265b264a:fr-CA": "Infrastructure et Outils",
    "29eb74e4:en-US": "Years of experience",
    "29eb74e4:fr-CA": "Années d'expériences",
    "2b9c137e:en-US": "Programming Languages",
    "2b9c137e:fr-CA": "Languages de Programmation",
    "2c445d99:en-US": "Come see my Github profile!",
    "2c445d99:fr-CA": "Venez voir mon profile Github",
    "2f8cf9b9:en-US": "A Python Flask extension that generates and serves favicon assets for diverse platforms.",
    "2f8cf9b9:fr-CA": "Une extension Python Flask qui génère et sert des fichiers favicon pour diverses plateformes.",
    "3022b744:en-US": "A Python Flask extension for serving hashed assets via cache-busting manifests.",
    "3022b744:fr-CA": "Une extension Python Flask pour servir des resources hachés via des manifestes de gestion de cache.",
    "309210ef:en-US": "I led the comprehensive frontend development of an innovative multimedia platform, prioritizing the creation of immersive and captivating user experiences. I’ve contributed to the platform’s distinctiveness and heightened visual presentation by meticulously implementing fully custom UI components as well as a completely custom CSS style, ensuring a unified and refined appearance across all aspects of the platform.",
    "309210ef:fr-CA": "J'ai dirigé le développement frontend complet d'une plateforme multimédia innovante, en mettant l'accent sur la création d'expériences utilisateur immersives et captivantes. J'ai contribué à l'originalité de la plateforme et à l'amélioration de sa présentation visuelle en concevant et en intégrant avec précision des composants d'interface utilisateur entièrement personnalisés, ainsi qu'un style CSS sur mesure, garantissant une apparence harmonieuse et soignée sur l'ensemble de la plateforme.",
    "33a118e5:en-US": "Frontend developer",
    "33a118e5:fr-CA": "Développeur frontend",
    "38039ba7:en-US": "As a freelance Level Designer, I had the honor of being contracted by Valve on three occasions to contribute to their content updates for the critically acclaimed game Team Fortress 2. I conceptualized, designed, and delivered original and groundbreaking game levels. My responsibilities encompassed conceptualization, 3D art, environmental design, game balance, scripting and optimization for each project.",
    "38039ba7:fr-CA": "En tant que Level Designer freelance, j'ai eu l'honneur d'être mandaté par Valve à trois reprises pour contribuer aux mises à jour de contenu de leur jeu acclamé par la critique, Team Fortress 2. J'ai conçu, développé et livré des niveaux de jeu originaux et novateurs. Mes responsabilités comprenaient la conceptualisation, la création 3D, le design environnemental, l'équilibrage du jeu, le scripting et l’optimisation pour chaque projet.",
    "3f07f8bd:en-US": "Soulzone",
    "3f07f8bd:fr-CA": "Soulzone",
    "4007536f:en-US": "At a Glance",
    "4007536f:fr-CA": "Aperçu",
    "423b8dc3:en-US": "3dverse",
    "423b8dc3:fr-CA": "3dverse",
    "43c731da:en-US": "(2024 to Present)",
    "43c731da:fr-CA": "(2024 à Maintenant)",
    "4c7b0cc2:en-US": "Graduated 2014",
    "4c7b0cc2:fr-CA": "Graduation 2014",
    "4c97c0ff:en-US": "That being said... there’s always more to it than meets the eye. That’s why I like to go deep into every facets of what makes software tick, whether it be in the frontend or backend.",
    "4c97c0ff:fr-CA": "Cela dit... ce n'est jamais aussi simple qu'il ne le parait. C'est pourquoi j'aime explorer en profondeur toutes les facettes de ce qui fait fonctionner un logiciel, que ce soit au frontend ou au backend.",
    "4ed852ec:en-US": "Contributed to user experience enhancements for account management features. Led backend optimizations that achieved a 500x reduction in API usage, significantly decreasing operational costs tied to core platform functionalities.",
    "4ed852ec:fr-CA": "Contribué à l’amélioration de l’expérience utilisateur pour la gestion des comptes. Piloté des optimisations backend réduisant l’usage des API par 500x, diminuant significativement les coûts opérationnels des fonctionnalités clés.",
    "4fb403e5:en-US": "working as a developer",
    "4fb403e5:fr-CA": "À titre de développeur",
    "512ab3c6:en-US": "Education",
    "512ab3c6:fr-CA": "Éducation",
    "51356bc9:en-US": "Postponed 2014 - 2015",
    "51356bc9:fr-CA": "En suspens 2014 - 2015",
    "55f3d446:en-US": "With companies such as",
    "55f3d446:fr-CA": "Avec des entreprises tel que",
    "56a2cd1f:en-US": "Mobile developer",
    "56a2cd1f:fr-CA": "Developpeur mobile",
    "57eb8538:en-US": "Professional Experiences",
    "57eb8538:fr-CA": "Éxperiences Proffessionnels",
    "60df4df8:en-US": "French, English",
    "60df4df8:fr-CA": "Français, Anglais",
    "61c09ce0:en-US": "Game Developer",
    "61c09ce0:fr-CA": "Développeur de Jeux",
    "6afdf3df:en-US": "Computer Science Technology - Collège Montmorency",
    "6afdf3df:fr-CA": "Techniques de l'Informatique - Collège Montmorency",
    "6b36d9b5:en-US": "Backend Frameworks and Technologies",
    "6b36d9b5:fr-CA": "Cadriciels et Technologies Backend",
    "6d8edea8:en-US": "Game developer",
    "6d8edea8:fr-CA": "Développeur de jeux",
    "702df67d:en-US": "I have created multiple libraries and tools which I actively develop and maintain.",
    "702df67d:fr-CA": "J'ai créé plusieurs composants logiciels et outils que je développe et maintiens activement.",
    "746c6626:en-US": "Web Development",
    "746c6626:fr-CA": "Developpeur Web",
    "78fdc75b:en-US": "(2016 to 2017)",
    "78fdc75b:fr-CA": "(2016 à 2017)",
    "7bc41b5e:en-US": "Led the frontend development of a multimedia entertainment platform with a focus on rich user experiences. Elevated the platform’s distinctiveness and visual appeal by implementing a fully custom design system and meticulously crafted UI components, ensuring consistency and polish across all user-facing elements.",
    "7bc41b5e:fr-CA": "Dirigé le développement frontend d’une plateforme multimédia, axée sur une expérience utilisateur riche. Renforcé l’identité visuelle en créant un design system sur mesure et des composants UI soignés, garantissant cohérence et qualité sur l’ensemble des interfaces.",
    "7e654c54:en-US": "A set of debugging and automation tools tailored for the Source engine.",
    "7e654c54:fr-CA": "Un ensemble d'outils de débogage et d'automatisations conçus pour le moteur Source.",
    "80046d99:en-US": "(2015, 2022 and 2024)",
    "80046d99:fr-CA": "(2015, 2022 et 2024)",
    "8118b4b8:en-US": "programming, development, developer, web, website, maxdup",
    "8118b4b8:fr-CA": "programmation, développement, développeur, web, maxdup",
    "833b2e35:en-US": "Find me online",
    "833b2e35:fr-CA": "Où me trouver en ligne",
    "8945cf26:en-US": "During my brief tenure at Tenscores, I played a key role in enhancing the user experience for account management. Additionally, I undertook significant backend improvements that resulted in a remarkable 500-fold reduction in API usage. This, in turn, substantially lowered operational expenses associated with critical platform features.",
    "8945cf26:fr-CA": "Lors de mon passage chez Tenscores, j’ai joué un rôle clé dans l’amélioration de l’expérience utilisateur pour la gestion des comptes. De plus, j’ai apporté des améliorations majeures au backend, entraînant une réduction spectaculaire de l’utilisation de l’API par un facteur de 500. Cela a permis de diminuer considérablement les coûts opérationnels liés aux fonctionnalités essentielles de la plateforme.",
    "8b819334:en-US": "page 1 of 3",
    "8b819334:fr-CA": "page 1 de 3",
    "8d23a86d:en-US": "Fullstack developer",
    "8d23a86d:fr-CA": "Developpeur Fullstack",
    "9048e77c:en-US": "page 3 of 3",
    "9048e77c:fr-CA": "page 3 de 3",
    "90ef1e33:en-US": "(2014)",
    "90ef1e33:fr-CA": "(2014)",
    "9bd507b6:en-US": "Soulzone inc.",
    "9bd507b6:fr-CA": "Soulzone inc.",
    "9d6e6843:en-US": "I tend to be product-oriented.<br>To me, the end-user experience is the only measure of success.",
    "9d6e6843:fr-CA": "Je suis axé sur le produit. Pour moi, l'expérience de l'utilisateur final est la seule mesure de succès.",
    "9f11138f:en-US": "Software Engineering - École de technologie supérieure",
    "9f11138f:fr-CA": "Génie Logiciel - École de technologie supérieure",
    "a3ccfadb:en-US": "Being a Tech co-founder, I’ve had to architect a scalable backend system that effectively manages data flow, user authentication, and API integrations to support seamless functionality across all platforms. Additionally, I’ve had to engineer hybrid mobile applications that synchronized with the backend, ensuring consistent user experiences and optimal performance.",
    "a3ccfadb:fr-CA": "En tant que cofondateur technique, j'ai dû concevoir une architecture backend évolutive permettant de gérer efficacement le flux de données, l'authentification des utilisateurs et les intégrations d'API, afin d'assurer un fonctionnement fluide sur toutes les plateformes. De plus, j'ai développé des applications mobiles hybrides synchronisées avec le backend, garantissant une expérience utilisateur homogène et des performances optimales.",
    "a608a393:en-US": "Hi, I’m Maxime, <br>a Montréal-based web developer.",
    "a608a393:fr-CA": "Salut, je m'appele Maxime, un développeur web basé à Montréal.",
    "aee13d67:en-US": "Contracted by Valve on three separate occasions to contribute to content updates for the critically acclaimed Team Fortress 2. Designed and delivered original, high-impact game levels, with responsibilities spanning conceptualization, 3D art, environmental design, gameplay balance, scripting, and performance optimization.",
    "aee13d67:fr-CA": "Mandaté à trois reprises par Valve pour contribuer à des mises à jour de contenu pour le jeu acclamé Team Fortress 2. Conçu et livré des niveaux originaux à impact élevé, couvrant conception, art 3D, design d’environnement, équilibrage des éléments gameplay, scripting et optimisation des performances.",
    "b99fa130:en-US": "Montréal based web developer",
    "b99fa130:fr-CA": "Développeur web basé à Montréal.",
    "b9d09eff:en-US": "A collection of Python libraries designed to handle various game asset file types.",
    "b9d09eff:fr-CA": "Une collection de composants logiciels Python conçus pour gérer différents types d'éléments de jeu.",
    "bb82b360:en-US": "Full-stack Web Developer",
    "bb82b360:fr-CA": "Développeur Web Full-Stack",
    "c460186a:en-US": "Designed and implemented a scalable backend infrastructure to handle data flow, user authentication, and API integrations, ensuring seamless cross-platform functionality. Also developed hybrid mobile applications tightly integrated with the backend to deliver consistent user experiences and high performance.",
    "c460186a:fr-CA": "Conçu et mis en place une infrastructure backend évolutive pour gérer le flux de données, l’authentification et les intégrations API, assurant une fonctionnalité fluide multiplateforme. Développé des applications mobiles hybrides intégrées au backend pour garantir une expérience utilisateur cohérente et performante.",
    "d2ae0762:en-US": "page 2 of 3",
    "d2ae0762:fr-CA": "page 2 de 3",
    "ea938067:en-US": "Tech co-founder/full-stack/mobile developer",
    "ea938067:fr-CA": "Co-fondateur Tech/Developpeur",
    "ec5bfb3d:en-US": "Build tools and bundler designed for Source engine level creation.",
    "ec5bfb3d:fr-CA": "Des outils de construction et un gestionnaire de paquets conçus pour la création de niveaux sur le moteur Source.",
    "ed749e0b:en-US": "Game Development",
    "ed749e0b:fr-CA": "Development de Jeux",
    "edaedfd2:en-US": "As a passionate web developer and game developer, I have been actively involved in the open-source community, with a particular focus on the Python ecosystem.",
    "edaedfd2:fr-CA": "En tant que passionné du développement web et du développement de jeux, j’ai été activement impliqué dans la communauté open-source, avec un intérêt particulier pour l’écosystème Python.",
    "f571a668:en-US": "Occupying roles such as",
    "f571a668:fr-CA": "À titre de",
    "f75e891a:en-US": "My commitment to code quality is reflected in my projects through rigorous testing, continuous integration, and comprehensive documentation.",
    "f75e891a:fr-CA": "Mon engagement envers la qualité du code se reflète dans mes projets à travers des tests rigoureux, une intégration continue et une documentation approfondie.",
    "f8d27896:en-US": "UI Frameworks and Technologies",
    "f8d27896:fr-CA": "Cadriciels UI et Technologies",
    "fd5ff079:en-US": "I contributed to the enhancement of the platform’s developer console, pushing forward cutting edge 3D technologies for the web. I led the development of a powerful graph editor to drive 3d engine capabilities. Led the development of a government-funded innovation project, successfully over-seeing execution of the key features.",
    "fd5ff079:fr-CA": "J'ai contribué à l'amélioration de la console développeur de la plateforme, en faisant progresser les technologies 3D de pointe pour le web. J'ai dirigé le développement d'un éditeur de graphes performant permettant d'exploiter les capacités du moteur 3D. J'ai également mené le développement d'un projet d'innovation financé par le gouvernement, en supervisant avec succès l'exécution de ses fonctionnalités clés.",
    "fd7b8e07:en-US": "(2016 to 2023)",
    "fd7b8e07:fr-CA": "(2016 à 2023)"
}